# Practice of topic 2

#### BDAA : basis of data analysis

* dataframe : 리스트 형식으로 데이터를 담음 (아무 패키지 (= 라이브러리) 없이)
* dataframe 안에 또 다른 dataframe 작성 가능 (Nested dataframe)
* 리스트 요소를 가지고 오기 위해 for문 사용해서 추출

In [14]:
import sys 
print (sys.executable)

/usr/local/opt/python@3.11/bin/python3.11

In [6]:
slist = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, [0, 1]]

In [11]:
for i in range (len(slist)) :
    print (slist[i])
    
    if isinstance (slist[i], list) : # slist[i]가 리스트라면
        print (slist[i][-1]) # 그 nested dataframe component의 가장 마지막 component를 출력하게 하기

0
1
2
3
4
5
6
7
8
9
[0, 1]
1

* 데이터프레임은 차원이 무한이 증설이 가능 (일종의 행렬과 같음. 표니깐.)
* 행은 index, 열은 colomn이 됨

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
df = sns.load_dataset ('titanic') 
# seaborn) titanic 승선자의 데이터셋을 불러오기

In [6]:
df[['survived','pclass','sex','fare','class']] # 일정 column 출력

     survived  pclass     sex     fare   class
0           0       3    male   7.2500   Third
1           1       1  female  71.2833   First
2           1       3  female   7.9250   Third
3           1       1  female  53.1000   First
4           0       3    male   8.0500   Third
..        ...     ...     ...      ...     ...
886         0       2    male  13.0000  Second
887         1       1  female  30.0000   First
888         0       3  female  23.4500   Third
889         1       1    male  30.0000   First
890         0       3    male   7.7500   Third

[891 rows x 5 columns]

In [7]:
df # 전체 column 출력

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

data analyst가 되기 위한 process 중 가장 중요한 포인트 : 변수 분석
* 어떤 상황 속에서 결과를 좌지우지할 변수는 무엇일까?
* 그 변수가 모델링하기 좋은가? 그 변수가 다양한 결괏값을 명확하게 나누는가?

In [9]:
df_col = list (df.columns)
print (df_col)

['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone']

In [10]:
for i in df_col :
    print (i)

survived
pclass
sex
age
sibsp
parch
fare
embarked
class
who
adult_male
deck
embark_town
alive
alone

In [11]:
df.loc[:100, 'sex'] 
# loc[범위, 'column명']

0        male
1      female
2      female
3      female
4        male
        ...
96       male
97       male
98     female
99       male
100    female
Name: sex, Length: 101, dtype: object

데이터프레임을 직접 만들고 그를 이용해 통계적으로 분석하여 information으로 이끌어가는 것도 매우 중요

In [13]:
# pandas는 데이터프레임을 직접 만들 때 쓰기 좋은 패키지이다.

df_myself = pd.DataFrame ({'이름' : ['모래두지', '파치리스', '데덴네'],
                          '타입' : ['땅', '전기', '전기, 페어리'],
                          '현재 나이' : [3, 2, 0.3]})

In [15]:
age_sum = sum (df_myself['현재 나이'])
age_sum

5.3

In [18]:
print (float(age_sum/len(df_myself['현재 나이'])))

1.7666666666666666

In [19]:
df_myself

     이름       타입  현재 나이
0  모래두지        땅    3.0
1  파치리스       전기    2.0
2   데덴네  전기, 페어리    0.3

In [20]:
df_myself ['현재 나이'] # 한 column만 불러올 땐 시리즈 형태로 표시

0    3.0
1    2.0
2    0.3
Name: 현재 나이, dtype: float64

In [21]:
df_myself ['현재 나이'] * 3

0    9.0
1    6.0
2    0.9
Name: 현재 나이, dtype: float64

실제 데이터를 불러와서 분석하는 작업이 대다수이다.

* csv 데이터
* xlsx (엑셀) 데이터
...

In [23]:
df_ex = pd.read_excel ('excel_exam.xlsx')

In [25]:
df_ex.info() # 엑셀 파일의 기본적인 내용을 출력 (colomn, ro의 갯수, NULL이 있는지)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       20 non-null     int64
 1   nclass   20 non-null     int64
 2   math     20 non-null     int64
 3   english  20 non-null     int64
 4   science  20 non-null     int64
dtypes: int64(5)
memory usage: 932.0 bytes

In [26]:
df_ex.describe()

             id     nclass       math    english    science
count  20.00000  20.000000  20.000000  20.000000  20.000000
mean   10.50000   3.000000  57.450000  84.900000  59.450000
std     5.91608   1.450953  20.299015  12.875517  25.292968
min     1.00000   1.000000  20.000000  56.000000  12.000000
25%     5.75000   2.000000  45.750000  78.000000  45.000000
50%    10.50000   3.000000  54.000000  86.500000  62.500000
75%    15.25000   4.000000  75.750000  98.000000  78.000000
max    20.00000   5.000000  90.000000  98.000000  98.000000

In [27]:
df_ex_list = list(df_ex.columns)
df_ex_list

['id', 'nclass', 'math', 'english', 'science']